{
    "main": {
        "image": "profilepic.jpg",
        "social": [
            {
                "name": "linkedin",
                "url": "https://www.linkedin.com/in/vinay-kumar-b7527a1b4/",
                "className": "fa fa-linkedin"
            },
            {
                "name": "instagram",
                "url": "https://www.instagram.com/vinay_kumar01/",
                "className": "fa fa-instagram"
            },
            {
                "name": "github",
                "url": "https://github.com/vinayk02",
                "className": "fa fa-github"
            }
        ]
    },
    "resume": {
        "education": [
            {
                "school": "Rutgers University- New Brunswick",
                "degree": "Degree: Computer Science",
                "graduated": "Class of 2023",
                "awards": " Deans List Spring 2021, Fall 2021, Spring 2023",
                "relevantCoursework": " Intro to Computer Science, Data Structures, Discrete Structures 1 & 2, Computer Architecture, Intro to Artificial Intelligence, Software Methodology, Imaging and Multimedia, Design and Analysis of Computer Algorithms, Data Management",
                "description": " My relevant classwork includes: Intro to Computer Science, Data Structures, Discrete Structures 1 & 2, Computer Architecture, Intro to Artificial Intelligence, Software Methodology, Imaging and Multimedia, Design and Analysis of Computer Algorithms, Data Management. I was also a member of the Rutgers Mobile App Development Club, Rutgers Creation of Games Society, Rutgers Association of Punjabis Club, and National Society of Leadership and Success."
            }
        ],
        "experience": [
            {
                "company": "Priorityze",
                "title": "Developer | Owner ",
                "years": "January 2022 - Present",
                "description": "I created Priorityze with a vision of enhancing productivity, both for myself and others. Priorityze, available on the Apple App Store and Google Play Store, empowers users to organize and manage all their tasks with their own unique preferences. This innovative app, developed using React Native, seamlessly synchronizes tasks, subtasks, lists, and categories across multiple devices. What sets Priorityze apart is its integration of Artificial Intelligence, allowing for the rapid generation of intricate tasks with just a prompt. I also spearheaded a multi-platform marketing campaign, utilizing social media platforms such as Instagram and TikTok, to effectively promote the app to users around the world."
            },
            {
                "company": "Whiting-Turner",
                "title": "VDC Engineer Intern - VDC Engineer",
                "years": "May 2022 - Present",
                "description": "As an engineer, I have leveraged my technical expertise to create a more accurate representation of real-world conditions through the generation of multiple 3D models and laser scanning. In addition to this, I continue to oversee and meticulously quality-control various design and subcontractor models, streamlining the installation process. My responsibilities also included the production of multiple floor plan submittals, specifically for deck penetrations, ceiling penetrations, and reflected ceiling plans (RCPs). "
            },
            {
                "company": "Taste of India II",
                "title": "Shift Manager",
                "years": "June 2017 - July 2023",
                "description": "Taste of India 2 is an Indian restaurant in Staten Island, New York. I assisted in maintaining an online presence by updating the backend and frontend of the website regularly. I managed various types of orders including online, dine-in, and takeout. I also settled all transactions at the end of each switch"
            },
            {
                "company": "Hill West",
                "title": "Intern",
                "years": "June 2019- August 2019",
                "description": "Hill West is an industry-leading architectural firm known for creating beautiful high-rise towers in New York City. As an intern I contributed to keeping project submittals organized. I constructed a highly detailed 3d model of the exterior of a future project to present to investors. I also aided architects in the design of an apartment floor plan. I gained valuable knowledge such as the design process of high rise buildings as well as technical skills such as learning AutoCAD and Sketchup."
            }
        ],
        "skills": [
            {
                "name": "App Development",
                "description": "I have utilized React Native and Node JS to successfully develop and deploy an app that assists thousands of people to be more productive."
            },
            {
                "name": "UI/UX/Web Design & Development",
                "description": " I have experience with web design through Adobe XD and Adobe Photoshop. Additionally, I have developed websites using HTML, CSS, and Javascript. I have also created websites utilizing React.JS as well."
            },
            {
                "name": "Backend Development",
                "description": "I have utilized Node.JS and MySQL to create a custom backend for Priorityze. The backend is used to synchronize data across multiple devices, safely store user data using OAuth, and call multiple APIs to help users create more intricate tasks."
            },
            {
                "name": "Java",
                "description": "I have knowledge of how to use Java since I have been using it frequently for college projects since Fall 2020."
            },
            {
                "name": "3D Modeling & Construction Coordination",
                "description": "I can model objects such as houses, piping, and buildings using Sketchup, Rhino, and AutoCAD. I learned these programs through my internship at Hill West Architects. I learned the process of construction coordination by using Revizto through my internship at Whiting Turner."
            },

            {
                "name": "Social Media Marketing",
                "description": "I have experience with social media marketing using both Facebook and Instagram. I was able to assist Taste of India 2, which is my current part time job, in connecting and gaining more customers through the use of social media."
            },
            {
                "name": "Artificial Intelligence",
                "description": "I am learning artificial intelligence through the use of Python and Node JS."
            },
            {
                "name": "Game Development ",
                "description": "I am currently in the process of learning C# for game development in the Unity Engine."
            }
        ]
    },
    "portfolio": {
        "projects": [
            {
                "title": "Priorityze",
                "category": "Multi-Platform Application",
                "image": "FocusProject.png",
                "description": "A productivity app that empowers users to organize and manage all their tasks with their own unique preferences. This innovative app seamlessly synchronizes tasks, subtasks, lists, and categories across multiple devices. What sets Priorityze apart is its integration of Artificial Intelligence, allowing for the rapid generation of intricate tasks with just a prompt. I also spearheaded a multi-platform marketing campaign, utilizing social media platforms such as Instagram and TikTok, to effectively promote the app to users around the world.",
                "technologyUsed": " React Native, Node.JS, MySQL, OAuth, React.JS, Javascript, CSS",
                "link": "https://priorityze.app/",
                "bgColor": "#000000",
                "textColor": "#ffffff"
            },
            {
                "title": "Alloy Website",
                "category": "Website",
                "description": "A website that showcases the services and projects of Alloy Solutions, a company that I put some of my side projects under.",
                "technologyUsed": " HTML, CSS, JavaScript",
                "image": "AlloySite.png",
                "bgColor": "#000000",
                "textColor": "#ffffff",
                "link": "https://alloysolutions.us/"
            },
            {
                "title": "My Portfolio Website",
                "category": "Website",
                "description": "A website that showcases my personality, skills, projects, and experiences.",
                "technologyUsed": " React.JS, Javascript, CSS",
                "image": "01.jpg",
                "bgColor": "#000000",
                "textColor": "#ffffff",
                "link": "https://vinaykumarportfolio.pages.dev/"
            },
            {
                "title": "Barbershop Website",
                "category": "Website",
                "description": "A classy & effective website developed for a local barber to showcase his services and attract new customers.",
                "technologyUsed": " HTML, CSS, JavaScript",
                "image": "NoelWebsite.png",
                "bgColor": "#404040",
                "textColor": "#9e8a78",
                "link": "https://noels-barbershop.pages.dev/"
            },
            {
                "title": "Master Date Website",
                "category": "Website",
                "description": "A web application that assists user in planning and creating fantastic date ideas with ease.",
                "technologyUsed": " HTML, CSS, JavaScript",
                "image": "md.PNG",
                "bgColor": "#873d4e",
                "textColor": "#ffffff",
                "link": "https://masterdate.pages.dev/"
            },
            {
                "title": "Taste of India II Website (Work in Progress)",
                "category": "Website",
                "description": "A website that showcases the services and menu of Taste of India II, an Indian restaurant in Staten Island, New York.",
                "technologyUsed": " HTML, CSS, JavaScript",
                "image": "TasteOfIndia2.PNG",
                "bgColor": "#0e0d0e",
                "textColor": "#ffffff",
                "link": "https://www.tasteofindia2.com/"
            },
            {
                "title": "Construction Website",
                "category": "Website",
                "description": "A website that utilizes JavaScript to create an innovative and interactive construction website.",
                "technologyUsed": " HTML, CSS, JavaScript",
                "image": "ConstructionWebsite.PNG",
                "bgColor": "#000000",
                "textColor": "#ffffff",
                "link": "https://construction-website.pages.dev/"
            },

            {
                "title": "Mock Dashboard",
                "category": "Website",
                "description": "A mock dashboard that was used to test how good Boostrap Studio is at creating the frontend for custom dashboards.",
                "technologyUsed": " HTML, CSS, JavaScript, Bootstrap Studio",
                "bgColor": "#14213d",
                "textColor": "#ffffff",
                "image": "Screen Shot 2021-08-09 at 1.59.20 PM.png"
            },
            {
                "title": "Real Estate Mock Website",
                "category": "Website",
                "description": "A mock website that was created to test how good Boostrap Studio is at creating the frontend for real estate websites.",
                "technologyUsed": " HTML, CSS, JavaScript, Bootstrap Studio",
                "bgColor": "#ffffff",
                "textColor": "#000000",
                "image": "Real Estate.png"
            },

            {
                "title": "Vice Extension",
                "category": "Visual Studio Code Color Theme Extension",
                "description": "A Visual Studio Code color theme extension that I created to help developers code in a more visually appealing environment with a Miami Vice vibe.",
                "bgColor": "#000000",
                "textColor": "#ffffff",
                "image": "02.jpg"
            },
            {
                "title": "3-D render of the front view of a modern house",
                "category": "3-D Model",
                "description": "A 3-D model of a single story modern house that I designed that maximizes natural light and greenery in front to give it a natural feel. I utilized Sketchup to create and render this model.",
                "bgColor": "#d0ba6e",
                "textColor": "#ffffff",
                "image": "03.jpg"
            },
            {
                "title": "Basic Framework Render of a Modern House Design.",
                "category": "3-D Model",
                "description": "A basic framework of a modern house that I designed. I utilized Sketchup to create this model.",
                "bgColor": "#cbc5cf",
                "textColor": "#ffffff",
                "image": "04.jpg"
            }
        ]
    }
}
