{
  "main": {
    
    "image":"profilepic.jpg",
    "social":[
     
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/vinay-kumar-b7527a1b4/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/vinay_kumar01/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/vinayk02",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "education":[
      {
        "school":"Rutgers University- New Brunswick",
        "degree":"Degree: Computer Science",
        "graduated":"2020-Present",
        "description":" I am pursuing a Bachelor of Arts in Computer Science. I am a member of the Rutgers Mobile App Development Club, Rutgers Creation of Games Society, Rutgers Association of Punjabis Club, and National Society of Leadership and Success."

       
      },
      {
        "school":"City College of New York",
        "degree":"Degree: Undecided",
        "graduated":"2019-2020",
        "description":"I was nominated for the National Society of Collegiate Scholars"
      },
      {
        "school":"Tottenville High School",
        "degree":"Degree: H.S. Diploma",
        "graduated":"September 2015 - June 2019",
        "description":"In high school, I was in the architecture program from Fall 2017- June 2019. I also attended College Now Classes in the Spring of 2018. I was also nominated for the National Youth Leadership Forum (NYLF). In addition, I was nominated for the National Academy for Future Scientists and Technologists."
      }
    ],
    "experience":[
      {
        "company":"Taste of India II",
        "title":"Receptionist | Waiter | Social Media Manager",
        "years":"May 2017 - Present",
        "description":"Taste of India II is an Indian restaurant in Staten Island, New York. I have been working there since May 2017. I am responsible for setting up the dining room for lunch and dinner. I handle phone orders and also take care of cash management and credit card settling. Additionally, I helped manage the social media accounts."
      },
      {
        "company":"Hill West",
        "title":"Intern",
        "years":"June 19- August 2019",
        "description":"Hill West is an industry-leading architectural firm known for creating beautiful high-rise towers in New York City. During my summer internship at Hill West, I learned about the design process when it comes to designing high-rise buildings. I learned basic AutoCAD skills and learned how to virtually model buildings using SketchUp.. I helped organize project submittals for 130 William Street. I made a 3D model and assisted in potential designs of an apartment floor plan for the 160 Clarkson Ave project."
      },
      {
        "company":"Jacques Marchais Museum of Tibetan Art",
        "title":"Volunteer",
        "years":"June 2017 - August 2017",
        "description":"Jacques Marchais Museum of Tibetan Art is located in Staten Island, New York. It is home to one of the most extensive collections of Himalayan artifacts. It is a uniquely peaceful retreat that features a beautiful garden. During my time at the museum, I helped maintain the garden and artifacts. Additionally, I photographed the Tibetan showcases for archival purposes."
      },
      {
        "company":"Staten Island Hindu Temple",
        "title":"Volunteer",
        "years":"June 2017 - Present",
        "description":"As a volunteer at the Staten Island Hindu Temple, I help set up the dining room and serve food to templegoers. Additionally, I assist in setting and cleaning up services at the temple."
      }
    ],
    "skills":[
      {
        "name":"UI/UX/Web Design & Development",
        "description":" I have experience with web design through Adobe XD and Adobe Photoshop. Additionally, I have developed websites using HTML, CSS, and Javascript."
      },
      {
        "name":"Java",
        "description":"I have knowledge of how to use Java since I have been using it frequently for college projects since Fall 2020."
      },
      {
        "name":"3D Modeling",
        "description":"I am able to model objects such as houses and buildings using Sketchup, Rhino, and AutoCad. I was able to learn these programs through my internship at Hill West Architects."
      },
      {
        "name":"Social Media Marketing",
        "description":"I have experience with social media marketing using both Facebook and Instagram. I was able to assist Taste of India 2, which is my current part time job, in connecting and gaining more customers through the use of social media."
      },
      {
        "name":"C# and ReactJS",
        "description":"I am currently in the process of learning C# and ReactJS for app and game development for future projects."
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"My Portfolio Website",
        "category":"Website",
        "image":"01.jpg"
        

        
      },
      {
        "title":"Alloy Website",
        "category":"Website",
        "image":"Alloy SIte.png"
      },
      {
        "title":"Mock Dashboard",
        "category":"Website",
        "image":"Screen Shot 2021-08-09 at 1.59.20 PM.png"
      },
      {
        "title":"Master Date Website",
        "category":"Website",
        "image":"md.PNG"
      },
      {
        "title":"Real Estate Mock Website",
        "category":"Website",
        "image":"Real Estate.png"
      },
      {
        "title":"Barbershop Website",
        "category":"Website",
        "image":"Noel Website.png"
      },
      
      {
        "title":"Marble Logo",
        "category":"Logo",
        "image":"marble.png"
      },
      {
        "title":"Master Date Logo",
        "category":"Website",
        "image":"md-final-logo.png"
      },
      
      {
        "title":"Vice Extension",
        "category":"Visual Studio Code Color Theme Extension",
        "image":"02.jpg"
      },
      {
        "title":"3-D render of the front view of a modern house",
        "category":"3-D Model",
        "image":"03.jpg"
      },
      {
        "title":"Basic Framework Render of a Modern House Design.",
        "category":"3-D Model",
        "image":"04.jpg"
      },
      {
        "title":"Taste of India 2 Instagram Account",
        "category":"Instagram Account",
        "image":"05.jpg"
      }
    ]
  }
}
